Public Types | Public Member Functions | Public Attributes | List of all members
API_AttributePickerParams Class Reference
Attribute Management | Dialog and Palette integration
Describes the type and the push check for creating an attribute picker in ACAPI_Dialog_CreateAttributePicker. More...
#include <APIdefs_Interface.h>
 Public Types
enum class  | PushCheckAppearance { ArrowIconAndText , ArrowOnly }
Type of the push check item apperance in the button. More...
enum class  | EmptySelectionBehaviour { SelectFirst , SelectNothing }
enum class  | LockedLayersStatus { Disabled , Enabled }
 Public Member Functions
API_AttributePickerParams ()
 Public Attributes
API_UserControlType  | type
Requested type of the user control.
short  | dialogID = 0
Id of the dialog of picker.
short  | itemID = 0
Id of the push check of picker.
PushCheckAppearance  | pushCheckAppearance
Defines whether the push check item should contain only an arrow icon pointing to right (PushCheckAppearance::ArrowOnly), or an icon and a text part also ( PushCheckAppearance::ArrowIconAndText).
EmptySelectionBehaviour  | emptySelectionBehaviour
Tells what should happen with the selection during opening the popup, when the selected attribute index is not in the usable attribute set. Either the first attribute should be selected (EmptySelectionBehaviour::SelectFirst) or nothing should be selected in the appearing popup ( EmptySelectionBehaviour::SelectNothing).
LockedLayersStatus  | lockedLayersStatus
Layer specific data that controls the appearance of locked layers in the Layer Picker. The value LockedLayersStatus::Disabled tells that locked layers are gray and unselectable. The default value of this field is LockedLayersStatus::Enabled.
Detailed Description
Describes the type and the push check for creating an attribute picker in ACAPI_Dialog_CreateAttributePicker.
Since
Archicad 26
Member Enumeration Documentation
◆ EmptySelectionBehaviour
 enum class API_AttributePickerParams::EmptySelectionBehaviour
strong
Enumerator
SelectFirst
SelectNothing
◆ LockedLayersStatus
 enum class API_AttributePickerParams::LockedLayersStatus
strong
Enumerator
Disabled
Enabled
◆ PushCheckAppearance
 enum class API_AttributePickerParams::PushCheckAppearance
strong
Type of the push check item apperance in the button.
Enumerator
ArrowIconAndText
ArrowOnly
Constructor & Destructor Documentation
◆ API_AttributePickerParams()
 API_AttributePickerParams::API_AttributePickerParams  |  ( |   | )
inline
Member Data Documentation
◆ dialogID
 API_AttributePickerParams::dialogID = 0
Id of the dialog of picker.
◆ emptySelectionBehaviour
 API_AttributePickerParams::emptySelectionBehaviour
Tells what should happen with the selection during opening the popup, when the selected attribute index is not in the usable attribute set. Either the first attribute should be selected (EmptySelectionBehaviour::SelectFirst) or nothing should be selected in the appearing popup ( EmptySelectionBehaviour::SelectNothing).
◆ itemID
 API_AttributePickerParams::itemID = 0
Id of the push check of picker.
◆ lockedLayersStatus
 API_AttributePickerParams::lockedLayersStatus
Layer specific data that controls the appearance of locked layers in the Layer Picker. The value LockedLayersStatus::Disabled tells that locked layers are gray and unselectable. The default value of this field is LockedLayersStatus::Enabled.
◆ pushCheckAppearance
 API_AttributePickerParams::pushCheckAppearance
Defines whether the push check item should contain only an arrow icon pointing to right (PushCheckAppearance::ArrowOnly), or an icon and a text part also ( PushCheckAppearance::ArrowIconAndText).
◆ type
 API_AttributePickerParams::type
Requested type of the user control.
Remarks
Supported types in version 26 and later:
APIUserControlType_Layer
APIUserControlType_BuildingMaterial
APIUserControlType_WallComposites
APIUserControlType_SlabComposites
APIUserControlType_RoofComposites
APIUserControlType_ShellComposites
APIUserControlType_OnlyCompFill
APIUserControlType_AllProfile
APIUserControlType_WallProfile
APIUserControlType_BeamProfile
APIUserControlType_ColumnProfile
APIUserControlType_HandrailProfile
APIUserControlType_OtherGDLObjectProfile
APIUserControlType_Material
APIUserControlType_MaterialWithGeneral
 Supported types in version 27 and later:
APIUserControlType_PolyFill
APIUserControlType_WallFill
APIUserControlType_WallCompFill
APIUserControlType_AllFillGradNoComp
APIUserControlType_CoverFill
APIUserControlType_PolyFillWithGradient
APIUserControlType_DashedLine
APIUserControlType_SymbolLine